tap "databricks/tap"
tap "datawire/blackbird"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "jesseduffield/lazydocker"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "screenplaydev/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Post-modern modal text editor
brew "helix"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# Pager program similar to more
brew "less"
# Implementation of the file(1) command
brew "libmagic"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Run multiple commands in parallel
brew "mprocs"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Tool for writing better scripts
brew "zx"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Utility that shows the latest app updates
cask "latest"
# App to manage software development and track bugs
cask "linear-linear"
# Customise mouse behavior
cask "linearmouse"
# File system integration
cask "macfuse"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# App that enables mouse-free UI interaction
cask "shortcat"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing-app"
# Multiplayer code editor
cask "zed@preview"
# Video communication and virtual meeting platform
cask "zoom"
mas "Equinox", id: 1591510203
mas "Pandan", id: 1569600264
mas "QuickShade", id: 931571202
mas "Xcode", id: 497799835
