base-files
base-passwd
bash
bat
bsdutils
build-essential
cmake
dash
diffutils
findutils
gh
grep
gzip
helix
hostname
init
jq
libdebconfclient0
libssl-dev
login
ncurses-base
ncurses-bin
openssl
ripgrep
shellcheck
stow
sysvinit-utils
ubuntu-minimal
ubuntu-standard
ubuntu-wsl
unzip
zsh
zsh-syntax-highlighting
