1password
1password-cli
alacritty
altair-graphql-client
beekeeper-studio
chromedriver
cursor
discord
floorp
font-monaspace
gcloud-cli
ghostty
google-cloud-sdk
hiddenbar
karabiner-elements
linear-linear
linearmouse
macfuse
monitorcontrol
ngrok
notion
raycast
responsively
shottr
slack
spotify
stats
visual-studio-code
yaak
zoom
