atuin
bash
bat
btop
carapace
cmake
colima
databricks/tap/databricks
diff-so-fancy
docker
docker-buildx
docker-compose
docker-credential-helper
duckdb
exiftool
fd
fselect
gawk
gh
git-delta
gitleaks
gnupg
grep
guile
gzip
helix
heroku/brew/heroku
htop
httpie
hyperfine
jq
just
less
libmagic
libyaml
mprocs
openjdk
python@3.9
ripgrep
shellcheck
spotify_player
stow
tcl-tk
tctl
telnet
tree
unzip
vivid
watchman
wget
wimlib
xh
zlib
zsh-syntax-highlighting
zx
