automake
bash
bat
brotli
c-ares
cmake
gawk
gh
gnupg
grep
gromgit/fuse/sshfs-mac
guile
gzip
helix
jq
krb5
libtermkey
libvterm
luajit
luv
msgpack
ncurses
openjdk
ripgrep
shellcheck
six
stow
tcl-tk
tctl
torsocks
unzip
wimlib
zlib
zsh-syntax-highlighting
