atuin
bash
bat
cmake
duckdb
exiftool
gawk
gh
git-delta
gitleaks
grep
guile
gzip
helix
heroku/brew/heroku
httpie
jq
less
libgit2@1.7
libmagic
libyaml
openjdk
postgis
postgresql@14
python@3.9
redis
ripgrep
shellcheck
spotify_player
stow
tcl-tk
tctl
telnet
tippecanoe
tree
unzip
watchman
wget
wimlib
zlib
zsh-syntax-highlighting
