1password
1password-cli
alacritty
cursor
floorp
font-monaspace
ghostty
google-cloud-sdk
hiddenbar
karabiner-elements
linearmouse
macfuse
monitorcontrol
ngrok
raycast
shottr
slack
spotify
stats
visual-studio-code
