1password
alacritty
alt-tab
altair-graphql-client
beekeeper-studio
chromedriver
discord
font-monaspace
google-cloud-sdk
hiddenbar
karabiner-elements
linearmouse
macfuse
monitorcontrol
ngrok
notion
orbstack
raycast
shottr
slack
spotify
stats
visual-studio-code
zoom
