anysphere.cursorpyright
anysphere.pyright
astro-build.astro-vscode
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
detachhead.basedpyright
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
github.vscode-github-actions
gregoire.dance
gruntfuggly.todo-tree
janisdd.vscode-edit-csv
lourenci.go-to-spec
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vsliveshare.vsliveshare
naumovs.color-highlight
nefrob.vscode-just-syntax
oliverkovacs.word-count
orta.vscode-twoslash-queries
otovo-oss.htmx-tags
quicktype.quicktype
redhat.vscode-yaml
steoates.autoimport
tamasfe.even-better-toml
tomoki1207.pdf
tomrijndorp.find-it-faster
unifiedjs.vscode-mdx
usernamehw.errorlens
valentjn.vscode-ltex
vespa-dev-works.jestrunit
yoavbls.pretty-ts-errors
