antfu.file-nesting
antfu.smart-clicks
antfu.where-am-i
anysphere.cursorpyright
anysphere.pyright
astro-build.astro-vscode
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
biomejs.biome
blueglassblock.better-json5
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
detachhead.basedpyright
eamodio.gitlens
emilast.logfilehighlighter
esbenp.prettier-vscode
foxundermoon.shell-format
github.vscode-github-actions
gregoire.dance
gruntfuggly.todo-tree
janisdd.vscode-edit-csv
kevinrose.vsc-python-indent
ltex-plus.vscode-ltex-plus
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
naumovs.color-highlight
nefrob.vscode-just-syntax
oliverkovacs.word-count
orta.vscode-twoslash-queries
otovo-oss.htmx-tags
patbenatar.advanced-new-file
quicktype.quicktype
redhat.vscode-xml
redhat.vscode-yaml
simonsiefke.svg-preview
tamasfe.even-better-toml
tomrijndorp.find-it-faster
unifiedjs.vscode-mdx
usernamehw.errorlens
valentjn.vscode-ltex
yoavbls.pretty-ts-errors
