antfu.file-nesting
antfu.smart-clicks
antfu.where-am-i
anysphere.cursorpyright
anysphere.pyright
anysphere.remote-ssh
astro-build.astro-vscode
be5invis.vscode-custom-css
bierner.markdown-checkbox
bierner.markdown-preview-github-styles
biomejs.biome
blueglassblock.better-json5
bradlc.vscode-tailwindcss
charliermarsh.ruff
davidanson.vscode-markdownlint
detachhead.basedpyright
eamodio.gitlens
emilast.logfilehighlighter
esbenp.prettier-vscode
foxundermoon.shell-format
github.vscode-github-actions
gregoire.dance
gruntfuggly.todo-tree
janisdd.vscode-edit-csv
kevinrose.vsc-python-indent
ltex-plus.vscode-ltex-plus
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
mvllow.rose-pine
naumovs.color-highlight
nefrob.vscode-just-syntax
oliverkovacs.word-count
orta.vscode-twoslash-queries
redhat.vscode-xml
redhat.vscode-yaml
rimuruchan.vscode-fix-checksums-next
rszyma.vscode-kanata
rust-lang.rust
slevesque.shader
subframe7536.custom-ui-style
tamasfe.even-better-toml
unifiedjs.vscode-mdx
usernamehw.errorlens
valentjn.vscode-ltex
vitest.explorer
yoavbls.pretty-ts-errors
